BitNibble/Source_Library/stm32f446lib/stm32446adc123.c
	stm32446_adc3_cr1.eocie = STM32446ADC3_cr1_eocie;
	stm32446_adc3_cr1.awdch = STM32446ADC3_cr1_awdch;
	return stm32446_adc3_cr1;
}
STM32446ADC_CR2 stm32446_adc3_cr2_inic(void)
{
	STM32446ADC_CR2 stm32446_adc3_cr2;
	// CR2
	stm32446_adc3_cr2.swstart = STM32446ADC3_cr2_swstart;
	stm32446_adc3_cr2.read_swstart = STM32446ADC3_cr2_read_swstart;
	stm32446_adc3_cr2.exten = STM32446ADC3_cr2_exten;
	stm32446_adc3_cr2.extsel = STM32446ADC3_cr2_extsel;
	stm32446_adc3_cr2.jswstart = STM32446ADC3_cr2_jswstart;
	stm32446_adc3_cr2.jexten = STM32446ADC3_cr2_jexten;
	stm32446_adc3_cr2.jextsel = STM32446ADC3_cr2_jextsel;
	stm32446_adc3_cr2.align = STM32446ADC3_cr2_align;
	stm32446_adc3_cr2.eocs = STM32446ADC3_cr2_eocs;
	stm32446_adc3_cr2.dds = STM32446ADC3_cr2_dds;
	stm32446_adc3_cr2.dma = STM32446ADC3_cr2_dma;
	stm32446_adc3_cr2.cont = STM32446ADC3_cr2_cont;
	stm32446_adc3_cr2.adon = STM32446ADC3_cr2_adon;
	return stm32446_adc3_cr2;
}
STM32446ADC_SMPR1 stm32446_adc3_smpr1_inic(void)
{
	STM32446ADC_SMPR1 stm32446_adc3_smpr1;
	// SMPR1
	stm32446_adc3_smpr1.smp18 = STM32446ADC3_smpr1_smp18;
	stm32446_adc3_smpr1.smp17 = STM32446ADC3_smpr1_smp17;
	stm32446_adc3_smpr1.smp16 = STM32446ADC3_smpr1_smp16;
	stm32446_adc3_smpr1.smp15 = STM32446ADC3_smpr1_smp15;
	stm32446_adc3_smpr1.smp14 = STM32446ADC3_smpr1_smp14;
	stm32446_adc3_smpr1.smp13 = STM32446ADC3_smpr1_smp13;
	stm32446_adc3_smpr1.smp12 = STM32446ADC3_smpr1_smp12;
	stm32446_adc3_smpr1.smp11 = STM32446ADC3_smpr1_smp11;
	stm32446_adc3_smpr1.smp10 = STM32446ADC3_smpr1_smp10;
	return stm32446_adc3_smpr1;
}
STM32446ADC_SMPR2 stm32446_adc3_smpr2_inic(void)
{
	STM32446ADC_SMPR2 stm32446_adc3_smpr2;
	// SMPR2
	stm32446_adc3_smpr2.smp9 = STM32446ADC3_smpr2_smp9;
	stm32446_adc3_smpr2.smp8 = STM32446ADC3_smpr2_smp8;
	stm32446_adc3_smpr2.smp7 = STM32446ADC3_smpr2_smp7;
	stm32446_adc3_smpr2.smp6 = STM32446ADC3_smpr2_smp6;
	stm32446_adc3_smpr2.smp5 = STM32446ADC3_smpr2_smp5;
	stm32446_adc3_smpr2.smp4 = STM32446ADC3_smpr2_smp4;
	stm32446_adc3_smpr2.smp3 = STM32446ADC3_smpr2_smp3;
	stm32446_adc3_smpr2.smp2 = STM32446ADC3_smpr2_smp2;
	stm32446_adc3_smpr2.smp1 = STM32446ADC3_smpr2_smp1;
	stm32446_adc3_smpr2.smp0 = STM32446ADC3_smpr2_smp0;
	return stm32446_adc3_smpr2;
}
STM32446ADC_SQR1 stm32446_adc3_sqr1_inic(void)
{
	STM32446ADC_SQR1 stm32446_adc3_sqr1;
	// SQR1
	stm32446_adc3_sqr1.l = STM32446ADC3_sqr1_l;
	stm32446_adc3_sqr1.sq16 = STM32446ADC3_sqr1_sq16;
	stm32446_adc3_sqr1.sq15 = STM32446ADC3_sqr1_sq15;
	stm32446_adc3_sqr1.sq14 = STM32446ADC3_sqr1_sq14;
	stm32446_adc3_sqr1.sq13 = STM32446ADC3_sqr1_sq13;
	return stm32446_adc3_sqr1;
}
STM32446ADC_SQR2 stm32446_adc3_sqr2_inic(void)
{
	STM32446ADC_SQR2 stm32446_adc3_sqr2;
	// SQR2
	stm32446_adc3_sqr2.sq12 = STM32446ADC3_sqr2_sq12;
	stm32446_adc3_sqr2.sq11 = STM32446ADC3_sqr2_sq11;
	stm32446_adc3_sqr2.sq10 = STM32446ADC3_sqr2_sq10;
	stm32446_adc3_sqr2.sq9 = STM32446ADC3_sqr2_sq9;
	stm32446_adc3_sqr2.sq8 = STM32446ADC3_sqr2_sq8;
	stm32446_adc3_sqr2.sq7 = STM32446ADC3_sqr2_sq7;
	return stm32446_adc3_sqr2;
}
STM32446ADC_SQR3 stm32446_adc3_sqr3_inic(void)
{
	STM32446ADC_SQR3 stm32446_adc3_sqr3;
	// SQ3
	stm32446_adc3_sqr3.sq6 = STM32446ADC3_sqr3_sq6;
	stm32446_adc3_sqr3.sq5 = STM32446ADC3_sqr3_sq5;
	stm32446_adc3_sqr3.sq4 = STM32446ADC3_sqr3_sq4;
	stm32446_adc3_sqr3.sq3 = STM32446ADC3_sqr3_sq3;
	stm32446_adc3_sqr3.sq2 = STM32446ADC3_sqr3_sq2;
	stm32446_adc3_sqr3.sq1 = STM32446ADC3_sqr3_sq1;
	return stm32446_adc3_sqr3;
}
STM32446ADC_JSQR stm32446_adc3_jsqr_inic(void)
{
	STM32446ADC_JSQR stm32446_adc3_jsqr;
	// JSQR
	stm32446_adc3_jsqr.jl = STM32446ADC3_jsqr_jl;
	stm32446_adc3_jsqr.jsq4 = STM32446ADC3_jsqr_jsq4;
	stm32446_adc3_jsqr.jsq3 = STM32446ADC3_jsqr_jsq3;
	stm32446_adc3_jsqr.jsq2 = STM32446ADC3_jsqr_jsq2;
	stm32446_adc3_jsqr.jsq1 = STM32446ADC3_jsqr_jsq1;
	return stm32446_adc3_jsqr;
}
/*** ADC3 ***/
void STM32446Adc3IClock(uint8_t bool)
{
	if(bool){ RCC->APB1ENR |= (1 << 29); } // DACEN: DAC interface clock enable
	else{ RCC->APB1ENR &= ~(1 << 29); } // DACEN: DAC interface clock disable
}
void STM32446Adc3Clock(uint8_t bool)
{
	if(bool){ RCC->APB2ENR |= (1 << 10); } // ADC3EN: ADC3 clock enable
	else{ RCC->APB2ENR &= ~(1 << 10); } // ADC3EN: ADC3 clock disable
}
void STM32446Adc3Nvic(uint8_t bool)
{
	if(bool){ setbit(NVIC->ISER, 1, 18, 1); } else{ setbit(NVIC->ICER, 1, 18, 1); }
}
void STM32446Adc3Inic(void)
{
	// ADC Clock
	// void STM32446Adc3IClock(1); // DACEN: DAC interface clock enable
	// STM32446Adc3Clock(1) // ADC3EN: ADC3 clock enable
	// ADC CONFIG
	STM32446ADC3_cr2_eocs(1); // EOCS: End of conversion selection
	STM32446ADC_ccr_adcpre(3); // ADCPRE: ADC prescaler, 11: PCLK2 divided by 8
	STM32446ADC3_smpr1_smp15(7); // SMPx[2:0]: Channel x sampling time selection
	STM32446ADC3_cr1_discen(1); // DISCEN: Discontinuous mode on regular channels
	STM32446ADC3_sqr3_sq1(15); // SQ1[4:0]: 1st conversion in regular sequence
}
void STM32446Adc3Start()
{
	// turn on select source and start reading
	STM32446ADC3_cr2_adon(1); // ADON: A/D Converter ON / OFF
	//
	STM32446ADC3_cr2_swstart(1); // SWSTART: Start conversion of regular channels
}
STM32446ADC3single stm32446_adc3_single_inic(void)
{
	STM32446ADC3single stm32446_adc3_single;
	stm32446_adc3_single.inic = STM32446Adc3Inic;
	stm32446_adc3_single.start = STM32446Adc3Start;
	return stm32446_adc3_single;
}
/*** ADC1 INIC Procedure & Function Definition ***/
STM32446ADC1obj adc1_inic(void)
{
	stm32446_adc1.reg = ADC1;
	/*** ADC1 Bit Mapping Link ***/
	stm32446_adc1.sr = stm32446_adc1_sr_inic();
	stm32446_adc1.cr1 = stm32446_adc1_cr1_inic();
	stm32446_adc1.cr2 = stm32446_adc1_cr2_inic();
	stm32446_adc1.smpr1 = stm32446_adc1_smpr1_inic();
	stm32446_adc1.smpr2 = stm32446_adc1_smpr2_inic();
	stm32446_adc1.jofr1 = STM32446ADC1_jofr1;
	stm32446_adc1.jofr2 = STM32446ADC1_jofr2;
	stm32446_adc1.jofr3 = STM32446ADC1_jofr3;
	stm32446_adc1.jofr4 = STM32446ADC1_jofr4;
	stm32446_adc1.htr = STM32446ADC1_htr;
	stm32446_adc1.ltr = STM32446ADC1_ltr;
	stm32446_adc1.sqr1 = stm32446_adc1_sqr1_inic();
	stm32446_adc1.sqr2 = stm32446_adc1_sqr2_inic();
	stm32446_adc1.sqr3 = stm32446_adc1_sqr3_inic();
	stm32446_adc1.jsqr = stm32446_adc1_jsqr_inic();
	stm32446_adc1.jdr1 = STM32446ADC1_jdr1;
	stm32446_adc1.jdr2 = STM32446ADC1_jdr2;
	stm32446_adc1.jdr3 = STM32446ADC1_jdr3;
	stm32446_adc1.jdr4 = STM32446ADC1_jdr4;
	stm32446_adc1.dr = STM32446ADC1_dr;
	stm32446_adc1.common = stm32446_adc_common_inic();
	/*** Other ***/
	stm32446_adc1.single = stm32446_adc1_single_inic();
	stm32446_adc1.iclock = STM32446Adc1IClock;
	stm32446_adc1.clock = STM32446Adc1Clock;
	stm32446_adc1.nvic = STM32446Adc1Nvic;
	return stm32446_adc1;
}

STM32446ADC1obj* adc1(void){ return (STM32446ADC1obj*) &stm32446_adc1; }

/*** ADC2 INIC Procedure & Function Definition ***/
STM32446ADC2obj adc2_inic(void)
{
	STM32446ADC2obj stm32446_adc2;
	stm32446_adc2.reg = ADC2;
	/*** ADC2 Bit Mapping Link ***/
	stm32446_adc2.sr = stm32446_adc2_sr_inic();
	stm32446_adc2.cr1 = stm32446_adc2_cr1_inic();
	stm32446_adc2.cr2 = stm32446_adc2_cr2_inic();
	stm32446_adc2.smpr1 = stm32446_adc2_smpr1_inic();
	stm32446_adc2.smpr2 = stm32446_adc2_smpr2_inic();
	stm32446_adc2.jofr1 = STM32446ADC2_jofr1;
	stm32446_adc2.jofr2 = STM32446ADC2_jofr2;
	stm32446_adc2.jofr3 = STM32446ADC2_jofr3;
	stm32446_adc2.jofr4 = STM32446ADC2_jofr4;
	stm32446_adc2.htr = STM32446ADC2_htr;
	stm32446_adc2.ltr = STM32446ADC2_ltr;
	stm32446_adc2.sqr1 = stm32446_adc2_sqr1_inic();
	stm32446_adc2.sqr2 = stm32446_adc2_sqr2_inic();
	stm32446_adc2.sqr3 = stm32446_adc2_sqr3_inic();
	stm32446_adc2.jsqr = stm32446_adc2_jsqr_inic();
	stm32446_adc2.jdr1 = STM32446ADC2_jdr1;
	stm32446_adc2.jdr2 = STM32446ADC2_jdr2;
	stm32446_adc2.jdr3 = STM32446ADC2_jdr3;
	stm32446_adc2.jdr4 = STM32446ADC2_jdr4;
	stm32446_adc2.dr = STM32446ADC2_dr;
	stm32446_adc2.common = stm32446_adc_common_inic();
	// Other
	stm32446_adc2.single = stm32446_adc2_single_inic();
	stm32446_adc2.iclock = STM32446Adc2IClock;
	stm32446_adc2.clock = STM32446Adc2Clock;
	stm32446_adc2.nvic = STM32446Adc2Nvic;
	return stm32446_adc2;
}
/*** ADC3 INIC Procedure & Function Definition ***/
STM32446ADC3obj adc3_inic(void)
{
	STM32446ADC3obj stm32446_adc3;
	stm32446_adc3.reg = ADC3;
	/*** ADC3 Bit Mapping Link ***/
	stm32446_adc3.sr = stm32446_adc3_sr_inic();
	stm32446_adc3.cr1 = stm32446_adc3_cr1_inic();
	stm32446_adc3.cr2 = stm32446_adc3_cr2_inic();
	stm32446_adc3.smpr1 = stm32446_adc3_smpr1_inic();
	stm32446_adc3.smpr2 = stm32446_adc3_smpr2_inic();
	stm32446_adc3.jofr1 = STM32446ADC3_jofr1;
	stm32446_adc3.jofr2 = STM32446ADC3_jofr2;
	stm32446_adc3.jofr3 = STM32446ADC3_jofr3;
	stm32446_adc3.jofr4 = STM32446ADC3_jofr4;
	stm32446_adc3.htr = STM32446ADC3_htr;
	stm32446_adc3.ltr = STM32446ADC3_ltr;
	stm32446_adc3.sqr1 = stm32446_adc3_sqr1_inic();
	stm32446_adc3.sqr2 = stm32446_adc3_sqr2_inic();
	stm32446_adc3.sqr3 = stm32446_adc3_sqr3_inic();
	stm32446_adc3.jsqr = stm32446_adc3_jsqr_inic();
	stm32446_adc3.jdr1 = STM32446ADC3_jdr1;
	stm32446_adc3.jdr2 = STM32446ADC3_jdr2;
	stm32446_adc3.jdr3 = STM32446ADC3_jdr3;
	stm32446_adc3.jdr4 = STM32446ADC3_jdr4;
	stm32446_adc3.dr = STM32446ADC3_dr;
	stm32446_adc3.common = stm32446_adc_common_inic();
	// Other
	stm32446_adc3.single = stm32446_adc3_single_inic();
	stm32446_adc3.iclock = STM32446Adc3IClock;
	stm32446_adc3.clock = STM32446Adc3Clock;
	stm32446_adc3.nvic = STM32446Adc3Nvic;
	return stm32446_adc3;
}

/*** EOF ***/

/******
1º Sequence
2º Scope
	- Library Scope
	- File Scope
	- Function Scope
	- Precedence Scope
3º Pointer and Variable
4º Casting
******/


